// عند استخدام JSON.stringify(value, replacer, space):
// space هو الوسيط الثالث، ويُستخدم فقط للتحكم في تنسيق وإظهار الـ JSON بشكل مرتب ومقروء.
// لو مستخدمش سيكون النص في سطر واحد بدون مسافات
// إذا وضعنا رقم (مثل 2 أو 4) → يحدد عدد المسافات المستخدمة للـ indentation (التباعد داخل الكائنات المتداخلة).
// إذا وضعنا نص (مثل "-" أو "👉") → يتم استخدام هذا النص بدل المسافات في التنسيق.   
// هذا الوسيط لا يؤثر على البيانات نفسها، بل فقط على المخرجات المعروضة (logging أو العرض البشري).

JSON.stringify(user, null, 2)  // مسافتين لكل مستوى
JSON.stringify(user, null, 4)  // أربع مسافات
JSON.stringify(user, null, "--") // يستخدم "--" للتنسيق
